<template>
  <div
    class="min-h-screen bg-gray-900 text-gray-100 flex flex-col items-center"
  >
    <UCard class="w-full max-w-4xl bg-gray-800 border-gray-700 shadow-2xl">
      <template #header>
        <h1 class="text-3xl font-bold text-center text-amber-400 tracking-wide">
          Порождения бездны
        </h1>
      </template>

      <div>
        <p class="text-lg text-gray-200 mb-6">
          Демонические существа, жаждущие хаоса. Их агрессивные способности
          наносят мощный урон, жертвуя выживаемостью ради подавляющей силы в
          прямых столкновениях и сея разрушение на поле боя.
        </p>

        <DataList :miniatures="miniatures"></DataList>
      </div>

      <template #footer>
        <div class="text-center py-4">
          <UButton
            to="/"
            variant="outline"
            size="lg"
            color="amber"
            class="hover:bg-amber-600 hover:text-gray-100 transition-colors"
          >
            Назад к расам
          </UButton>
        </div>
      </template>
    </UCard>
  </div>
</template>

<script setup>
const miniatures = ref([
  {
    id: 13,
    name: 'Владыка Бездны',
    health: 16,
    attack: 6,
    strike: '6, дистанция 10',
    defense: 5,
    speed: '6, полет',
    skills: [
      'Разлом тьмы: за 3 ПО создаёт разлом в радиусе 5 клеток; все миниатюры (вражеские и союзные) не могут покинуть зону до конца следующего раунда',
      'Повелитель ужаса: вражеские миниатюры в той же зоне не могут использовать активные способности',
    ],
  },
  {
    id: 14,
    name: 'Кровавый демон',
    health: 9,
    attack: 4,
    strike: '4, дистанция 6',
    defense: 4,
    speed: 6,
    skills: [
      'Пожирающий разум: за 2 ПО выбирает одну вражескую миниатюру в соседней зоне; она не может перемещаться в следующем раунде',
      'Глаза пустоты: получает +1 ПО, если находится в зоне захвата флага с хотя бы одной вражеской миниатюрой',
    ],
  },
  {
    id: 15,
    name: 'Призрачный заклинатель',
    health: 2,
    attack: 2,
    strike: '2, дистанция 5',
    defense: 1,
    speed: 4,
    skills: [
      'Разрушительный вихрь: за 3 ПО атакует все вражеские миниатюры в той же зоне, заставляя каждую потерять 1 ПО',
      'Эхо Бездны: если Призрачный заклинатель находится в уникальной зоне добычи, он получает +2 ресурса',
    ],
  },
  {
    id: 16,
    name: 'Теневой клинок',
    health: 2,
    attack: 2,
    strike: '-',
    defense: 1,
    speed: 4,
    skills: [
      'Хаотичный разрыв: за 2 ПО атакует одну вражескую миниатюру в той же зоне, заставляя её потерять 1 ПО и переместиться в соседнюю зону',
      'Туман Бездны: если Теневой Клинок находится в зоне с врагами, враги теряют 1 ресурс при сборе в этой зоне',
    ],
  },
  {
    id: 17,
    name: 'Эфирный страж',
    health: 4,
    attack: 2,
    strike: '-',
    defense: 5,
    speed: 3,
    skills: [
      'Хватка Бездны: за 2 ПО перемещает одну вражескую миниатюру из соседней зоны в свою; получает +1 ПО, если это зона захвата флага',
      'Танец теней: при перемещении в зону добычи получает +1 ресурс',
    ],
  },
])
</script>
