<template>
  <div class="container">
    <h1>Правила настольной игры "Жатва"</h1>
    <div class="section">
      <h2>Общие правила</h2>
      <ol>
        <li>
          В игре используются шестигранные кубы (далее к6) и четырехгранные
          (к4). Если игра просит выбросить к3, это означает, что надо кинуть к6
          и разделить пополам, округляя в большую сторону, например:
        </li>
      </ol>
      <table>
        <tr>
          <th>к6</th>
          <th>к3</th>
        </tr>
        <tr>
          <td>1, 2</td>
          <td>1</td>
        </tr>
        <tr>
          <td>3, 4</td>
          <td>2</td>
        </tr>
        <tr>
          <td>5, 6</td>
          <td>3</td>
        </tr>
      </table>
      <ol start="2">
        <li>
          Здесь изложены общие правила. Если в правилах армии написано иное, то
          оно переопределяет общее правило.
        </li>
      </ol>
    </div>

    <div class="section">
      <h2>Подготовка поля</h2>
      <h3>Размещение игрового поля:</h3>
      <p>
        Разверните игровое поле в центре стола. Поле состоит из следующих зон:
      </p>
      <ol>
        <li>
          <strong>4 базы игроков</strong>: по одной на каждой стороне карты.
          Внутри баз есть зоны для хранения ресурсов.
        </li>
        <li>
          <strong>5 зон добычи ресурсов</strong>:
          <ul>
            <li>Зоны пронумерованы.</li>
            <li>
              <strong>4 обычные зоны</strong>: могут содержать только базовые
              ресурсы (вода, изумруд, железо, дерево).
            </li>
            <li>
              <strong>1 уникальная зона</strong>: находится в центре поля, может
              содержать только золото.
            </li>
          </ul>
        </li>
        <li>
          <strong>4 зоны захвата флагов</strong>: флаги пронумерованы. Они
          расположены в углах карты, каждая содержит флаг, приносящий 1 победное
          очко за его контроль.
        </li>
      </ol>

      <h3>Подготовка компонентов:</h3>
      <ol>
        <li>
          Разместите жетоны обычных ресурсов: возьмите два случайных ресурса из
          мешочка (кроме золота) и бросьте к4. Положите ресурсы в центр
          соответствующей зоны. Проделайте то же самое с остальными зонами. Если
          цифра на кубике повторится – перебросьте его.
        </li>
        <li>Установите флаги (жетон огня) в центрах зон захвата флагов.</li>
        <li>Перемешайте колоду событий и положите рядом с полем лицом вниз.</li>
      </ol>

      <h3>Подготовка отрядов:</h3>
      <ol>
        <li>
          В первом раунде игроки бросают к4 для определения стартовой базы.
        </li>
        <li>
          Каждый игрок выбирает расу и получает соответствующий набор миниатюр.
        </li>
        <li>
          Каждый игрок получает:
          <ul>
            <li>Лист способностей расы.</li>
            <li>3 стартовых победных очка.</li>
            <li>Жетоны для отслеживания победных очков.</li>
            <li>Один кубик к6.</li>
          </ul>
        </li>
      </ol>

      <h3>Определение порядка хода:</h3>
      <ol>
        <li>
          Игроки бросают кубик к6 в <strong>начале каждого раунда</strong>.
          Игроки ходят от наибольшего результата к наименьшему. При одинаковых
          значениях эти игроки перебрасывают кубик.
        </li>
      </ol>
    </div>

    <div class="section">
      <h2>Расстановка миниатюр</h2>
      <h3>Подготовка базы:</h3>
      <ol>
        <li>
          Каждый игрок занимает одну из четырех баз, выбранных во время
          подготовки игрового поля. База — это стартовая зона для миниатюр
          игрока, защищенная от атак.
        </li>
        <li>
          Все миниатюры игрока размещаются на базе до начала первого раунда.
        </li>
      </ol>
      <h3>Завершение расстановки:</h3>
      <ol>
        <li>После расстановки начинается первый раунд игры.</li>
      </ol>
    </div>

    <div class="section">
      <h2>Начало раунда</h2>
      <p>
        В начале раунда игроки тянут одну карту события текущего раунда и
        выполняют ее условие. Затем каждый игрок бросает к6 на определение
        очередности хода в этом раунде (инициатива).
      </p>
    </div>

    <div class="section">
      <h2>Ход игрока</h2>
      <h3>Общий порядок хода:</h3>
      <ol>
        <li>
          Игра длится 10 раундов. В каждом раунде игроки ходят по очереди в
          порядке инициативы. Бросок к6 на инициативу выполняется в начале
          каждого раунда.
        </li>
        <li>Ход игрока состоит из двух фаз: Планирования и Действия.</li>
      </ol>

      <h3>Фаза планирования:</h3>
      <ol>
        <li>
          Игрок может потратить победные очки для активации способностей своей
          расы или миниатюры.
        </li>
        <li>Игрок может создать предметы из ресурсов (см. Крафт).</li>
      </ol>

      <h3>Фаза действий:</h3>
      <ol>
        <li>Игрок выполняет действия с миниатюрами в следующем порядке:</li>
        <li>
          Перемещение:
          <ul>
            <li>
              Каждая миниатюра может переместиться на количество клеток,
              указанное в правилах конкретной миниатюры.
            </li>
            <li>Ограничения перемещения:</li>
            <li>
              Обычные миниатюры беспрепятственно перемещаются только по дорогам.
              При прохождении по труднопроходимой местности требуется в два раза
              больше движения (например, чтобы пройти 1 клетку труднопроходимой
              местности, необходимо потратить 2 скорости движения).
            </li>
            <li>
              Миниатюры не могут ходить по воде (некоторые миниатюры могут
              беспрепятственно ходить по труднопроходимой местности или воде).
            </li>
          </ul>
        </li>
        <li>
          Добыча ресурсов:
          <ul>
            <li>
              В зоне добычи ресурсов игрок может собрать жетоны ресурсов, если
              там находятся его миниатюры. Бросьте к3 для того, чтобы узнать,
              сколько ресурсов вы можете унести.
            </li>
            <li>
              Уникальная зона: для добычи золота требуется минимум 2 миниатюры в
              зоне.
            </li>
            <li>Добытые ресурсы нужно отнести на свою базу.</li>
          </ul>
        </li>
        <li>
          Захват флагов:
          <ul>
            <li>
              Игрок может попытаться захватить флаг в зоне захвата, если там
              находится хотя бы одна его миниатюра.
            </li>
            <li>
              Если в зоне есть миниатюры других игроков, начинается бой (см.
              Бой).
            </li>
            <li>
              Если зона свободна, игрок должен удерживать контроль над флагом до
              своего следующего хода (а не до конца раунда). В последнем раунде
              игрок удерживает флаг до конца раунда.
            </li>
          </ul>
        </li>
        <li>Бой.</li>
      </ol>

      <h3>Фаза подсчета очков:</h3>
      <ol>
        <li>Игрок получает 1 победное очко за каждый захваченный флаг.</li>
        <li>
          Дополнительные очки можно получить за уничтожение миниатюр противника
          (1 очко за миниатюру).
        </li>
      </ol>

      <h3>Окончание хода:</h3>
      <ol>
        <li>После завершения всех фаз игрок передает ход следующему игроку.</li>
      </ol>
    </div>

    <div class="section">
      <h2>Добыча ресурсов и их использование</h2>
      <h3>Добыча ресурсов:</h3>
      <ol>
        <li>Ресурсы добываются в 5 зонах добычи на игровом поле:</li>
        <li>
          4 обычные зоны: содержат базовые ресурсы (древесина, железо, изумруд и
          вода).
        </li>
        <li>1 уникальная зона: содержит золото.</li>
        <li>
          Механика добычи:
          <ul>
            <li>Игрок отправляет миниатюры в зону добычи в свой ход.</li>
            <li>
              Каждая миниатюра в обычной зоне добывает к3 жетона базового
              ресурса за ход.
            </li>
            <li>Каждая миниатюра может нести только 3 ресурса.</li>
            <li>
              Для добычи в уникальной зоне требуется минимум 2 миниатюры игрока
              в зоне, и каждая пара миниатюр добывает 1 золото за ход.
            </li>
            <li>
              Если в зоне добычи находятся миниатюры других игроков, игроки
              могут:
            </li>
            <li>Договориться о разделе ресурсов (по взаимному согласию).</li>
            <li>Вступить в бой за контроль зоны (см. Бой).</li>
            <li>
              Ресурсы забираются из зоны и добавляются в запас миниатюры,
              которая должна принести ресурсы на свою базу.
            </li>
          </ul>
        </li>
      </ol>

      <h3>Использование ресурсов:</h3>
      <ol>
        <li>Ресурсы служат для следующих целей:</li>
        <li>Крафт предметов (см. Крафт).</li>
        <li>
          Получение победных очков:
          <ul>
            <li>
              В конце игры (10-й раунд) игрок может обменять ресурсы на победные
              очки:
            </li>
            <li>3 базовых ресурса = 1 победное очко.</li>
            <li>1 золото = 1 победное очко.</li>
          </ul>
        </li>
        <li>
          Ресурсы хранятся у игрока на базе до их использования или обмена. Нет
          лимита на количество ресурсов в запасе.
        </li>
        <li>
          Ресурсами можно обмениваться. Для этого игроки должны заключить союз,
          дать конкретной миниатюре нужный ресурс и встретиться с миниатюрой
          союзника.
        </li>
      </ol>
    </div>

    <div class="section">
      <h2>Правила боя</h2>
      <h3>Условия начала боя:</h3>
      <ol>
        <li>
          Бой начинается, если в одной зоне (добычи ресурсов или захвата флага)
          находятся миниатюры двух или более игроков, и хотя бы один игрок
          объявляет атаку в фазе действий.
        </li>
        <li>
          Бой начинается, если две миниатюры, не состоящие в союзе, стоят на
          соседних клетках.
        </li>
        <li>
          Игроки могут договориться о союзе, чтобы избежать боя и разделить
          контроль зоны или ресурсы. Если соглашение не достигнуто, бой
          обязателен.
        </li>
        <li>
          В бою миниатюра может использовать либо атаку, либо применение
          способности.
        </li>
      </ol>

      <h3>Механика боя:</h3>
      <ol>
        <li>
          Сила миниатюр: каждая миниатюра имеет базовые характеристики атаки и
          защиты, указанные в правилах миниатюры.
        </li>
        <li>
          Процесс боя:
          <ul>
            <li>
              Объявление атаки: игрок, инициирующий бой, выбирает, какие
              миниатюры участвуют. Противник может отступить или принять бой.
            </li>
            <li>Ход боя:</li>
            <li>
              Первой ходит та миниатюра, на которую напали. Она может сделать
              дополнительные к6 движения таким образом, чтобы оказаться ближе к
              противнику.
            </li>
            <li>
              Если противники стоят на соседних клетках, то они имеют право
              сражаться только атаками ближнего боя.
            </li>
            <li>
              В дальнем бою:
              <ul>
                <li>
                  Выберите цель для атаки или точку на местности. В дальнем бою
                  можно атаковать только одну цель.
                </li>
                <li>
                  Используйте графу "Атака" в правилах вашей миниатюры, чтобы
                  определить количество атак по цели.
                </li>
                <li>
                  Бросьте к6 за каждую атаку и прибавьте бонусы к атаке, если
                  они у вас есть. Каждое выпавшее число, которое больше
                  показателя защиты противника, считается успешным.
                </li>
                <li>
                  Нанесите одну рану этой миниатюре за каждое успешное
                  попадание.
                </li>
              </ul>
            </li>
            <li>
              В ближнем бою правила аналогичны, кроме количества атак: их можно
              применять к нескольким целям. Пример: если у вашей миниатюры 3
              атаки, то она может применить 2 атаки к одной миниатюре и 1 атаку
              к другой.
            </li>
          </ul>
        </li>
        <li>
          Потери:
          <ul>
            <li>
              Проигравшая сторона теряет все уничтоженные миниатюры в бою
              (кладутся на бок и считаются мертвыми). Через них можно проходить,
              но не останавливаться.
            </li>
          </ul>
        </li>
        <li>
          Отступление:
          <ul>
            <li>
              Если вместо вступления в бой миниатюра решает отступить, то она
              может сделать ход на к6 клеток так, чтобы оказаться дальше от
              противника.
            </li>
            <li>
              В этом раунде (если миниатюра еще не ходила, или в следующем —
              если ходила) эта миниатюра пропускает ход.
            </li>
          </ul>
        </li>
        <li>
          Эффекты:
          <ul>
            <li>
              Яд – миниатюра получает 1 урон в своем следующем ходу. Эффекты от
              ядов складываются.
            </li>
          </ul>
        </li>
      </ol>
    </div>
  </div>
</template>

<style scoped>
.container {
  margin: 0 auto;
}
h1,
h2,
h3 {
  color: #b8860b;
  font-weight: bold;
}
h1 {
  text-align: center;
  font-size: 2.5em;
}
h2 {
  font-size: 1.8em;
  margin-top: 20px;
}
h3 {
  font-size: 1.4em;
  margin-top: 15px;
}
p,
li {
  font-size: 1em;
  margin: 5px 0;
}
ul,
ol {
  padding-left: 20px;
  list-style: decimal;
}
table {
  width: 100%;
  border-collapse: collapse;
  margin: 10px 0;
}
th,
td {
  border: 1px solid #b8860b;
  padding: 8px;
  text-align: center;
}
th {
  background-color: #b3b3b3;
}
.section {
  margin-bottom: 20px;
}
</style>
