<template>
  <UContainer class="min-h-screen">
    <!-- Header Section -->
    <header class="py-8 text-center">
      <h1 class="text-4xl font-bold">Пепельные стрелки</h1>
      <p class="mt-2 text-lg">
        Пепельные стрелки - это люди, выжившие в мрачном мире, где пепел от
        сгоревших лесов покрывает землю. Их бледные лица скрыты под капюшонами,
        а глаза горят решимостью. Они мастера дальнего боя, использующие луки,
        арбалеты и метательные ножи, пропитанные ядами и магией. Из-за жизни в
        суровых условиях их тела хрупки, но их оружие позволяет поражать врагов
        на расстоянии, не вступая в ближний бой.
      </p>
    </header>

    <!-- Miniatures Section -->
    <DataList :miniatures="miniatures">></DataList>

    <!-- Back to Races Link -->
    <section class="py-12 text-center">
      <UButton to="/" variant="outline" size="lg"> Назад к расам </UButton>
    </section>
  </UContainer>
</template>

<script setup>
// Sample miniatures data for Terranthropes
const miniatures = ref([
  {
    id: 1,
    name: 'Арбалетчик',
    health: 6,
    attack: 1,
    strike: '3, дальность 5',
    defense: 2,
    speed: 5,
    skills: [
      'Разрывной болт (активная, 2 очка): Наносит 3 урона врагу в радиусе 8 клеток и 1 урон всем врагам в соседних клетках. ',
      'Прицельный выстрел (активная): Наносит 2 урона врагу в радиусе 6 клеток. Если цель не двигалась в этом ходу, урон увеличивается до 3.',
      'Пепельный заряд (пассивная): После выстрела Арбалетчик может переместиться на 1 клетку, оставляя дымный след, снижающий точность врагов (-1 к атаке) через эту клетку до конца хода.',
      'Осколочный болт (активная,1 очко): Стреляет в зону 2x2 клетки в радиусе 5 клеток, нанося 1 урон всем врагам и замедляя их (-1 к скорости) на следующий ход.',
    ],
  },
  {
    id: 2,
    name: 'Копьеносец',
    health: 15,
    attack: 4,
    strike: '5, дальность 5',
    defense: 5,
    speed: 7,
    skills: [
      'Призыв к меткости (активная, 1 очко): Все союзники в радиусе 3 клеток получают +5 к дальним атакам.',
      'Стремительный укол (активная): Атакует врага в радиусе 3 клеток копьём, нанося 2 урона, и отступает на 2 клетки, если возможно.',
      'Пепельная ловкость (пассивная): При атаке в ближнем бою получает +1 к защите и может переместиться на 1 клетку после атаки.',
      'Командный выстрел (активная, 2 очка): Наносит 3 урона врагу в радиусе 4 клеток. Если враг погибает, союзник в радиусе 3 клеток может сделать дальнюю атаку бесплатно.',
    ],
  },
  {
    id: 3,
    name: 'Лучник',
    health: 8,
    attack: 1,
    strike: '3, дальность 7',
    defense: 3,
    speed: 6,
    skills: [
      'Крылатый взлёт (активная): Перемещается на 10 клеток, но не может атаковать в этом ходу.',
      'Перьевой вихрь (активная, 1 очко): Окружает вихрем союзника в радиусе 1 клетки, снижая точность дальних атак врагов (-1 к атаке) в этой зоне на 1 ход.',
      'Пикирующий удар (активная, 2 очка): Наносит 3 урона по площади в радиусе 2 клеток.',
    ],
  },
  {
    id: 4,
    name: 'Мастер ножей',
    health: 9,
    attack: 2,
    strike: '2, дистанция 4',
    defense: 2,
    speed: 5,
    skills: [
      'Шквал клинков (активная): Бросает ножи, нанося 2 урона каждому врагу в радиусе 4 клеток или 3 урона одной цели.',
      'Танец лезвий (активная): Бесплатно атакует врага в соседней клетке, нанося 2 урона, и может переместиться на 2 клетки до или после атаки.',
      'Меткий разрез (активная): За 2 очка наносит 4 урона врагу в радиусе 3 клеток или в ближнем бою. Если враг погибает, Мастер ножей получает 1 очко.',
    ],
  },
  {
    id: 7,
    name: 'Пращеносец',
    health: 7,
    attack: '-',
    strike: '4, дистанция 5',
    defense: 2,
    speed: 5,
    skills: [
      'Огненное ядро (активная, 1 очко): Метает ядро с порохом в радиусе 6 клеток, нанося 3 урона цели и 1 урон всем в радиусе 1 клетки от неё.',
      'Дымный выстрел (активная): Метает ядро, создающее дымное облако в радиусе 2 клеток на 4 клетках от себя, снижая точность врагов (-1 к атаке) до конца следующего хода.',
      'Пепельный вихрь (пассивная): После атаки Пращеносец может переместиться на 1 клетку, оставляя дымную завесу вокруг себя, которая снижает меткость врагов (-1 к меткости), если целью является Пращеносец.',
      'Взрывной бросок (активная, 1 очко): Метает ядро с порохом в радиусе 5 клеток, нанося 2 урона и отбрасывая врага на 1 клетку, если он не в укрытии.',
    ],
  },
])
</script>
